InformationRegisters/НастройкиОбменаВетисAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОбменаВетисAPI</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоПопытокПолученияРезультатаПриОшибкахAPLM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбновлениеПоИзменениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СмещениеВСпискахЗапросов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СмещениеДатыНачалаЗагрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийОбменаAPI</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиОбменаВетисAPI/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Элементы.ОбновлениеПоИзменениям.Видимость = Запись.ВидОперации = Справочники.ВидыОперацийОбменаAPI.АктуализацияКонтрагентов
		ИЛИ Запись.ВидОперации = Справочники.ВидыОперацийОбменаAPI.АктуализацияПредприятий
		ИЛИ Запись.ВидОперации = Справочники.ВидыОперацийОбменаAPI.АктуализацияПродукции;
		
	Элементы.КоличествоПопытокПолученияРезультатаПриОшибкахAPLM.Видимость = Запись.ВидОперации = Справочники.ВидыОперацийОбменаAPI.ЗагрузкаДанныхПоВСД
		ИЛИ Запись.ВидОперации = Справочники.ВидыОперацийОбменаAPI.ЗагрузкаДанныхПоЗаписямСкладскогоЖурнала
		ИЛИ Запись.ВидОперации = Справочники.ВидыОперацийОбменаAPI.АдминистрированиеПользователей;
		
	Элементы.СмещениеДатыНачалаЗагрузки.Видимость = Запись.ВидОперации <> Справочники.ВидыОперацийОбменаAPI.ПолучениеАдреснойИнформации
		И Запись.ВидОперации <> Справочники.ВидыОперацийОбменаAPI.АдминистрированиеПользователей;
	
КонецПроцедуры

#КонецОбласти
